
        IDENTIFICATION DIVISION.
        PROGRAM-ID. ISOGRAM.
        ENVIRONMENT DIVISION.
        
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-PHRASE PIC X(60).
        01 WS-RESULT PIC 99.

        LOCAL-STORAGE SECTION.
        01 PHRASE-IDX PIC 9(2) VALUE 1.
        01 LS-HISTOGRAM-STR PIC X(26) VALUE ALL "0".
        01 LS-HISTOGRAM-TABLE REDEFINES LS-HISTOGRAM-STR.
            05 LS-HISTOGRAM PIC 9(1) OCCURS 26 TIMES.
                88 IS-LESS-THAN-TWO VALUE 0, 1.
        01 LS-CHAR PIC X(1) VALUE " ".
            88 IS-ALPHA VALUE 'A' THRU 'Z'.
        01 LS-CHAR-NUM PIC 9(3) VALUE 0.
        

        PROCEDURE DIVISION.
        
        
        ISOGRAM.
            INITIALIZE LS-HISTOGRAM-STR
            MOVE FUNCTION UPPER-CASE(WS-PHRASE) TO WS-PHRASE
            MOVE 1 TO WS-RESULT
            PERFORM COUNT-CHAR-CHECK-DUPLICATE
                VARYING PHRASE-IDX FROM 1 BY 1
                UNTIL PHRASE-IDX > 60 OR WS-RESULT = 0.

        COUNT-CHAR-CHECK-DUPLICATE.
            MOVE WS-PHRASE(PHRASE-IDX:1) TO LS-CHAR
            IF IS-ALPHA
                COMPUTE LS-CHAR-NUM = FUNCTION ORD(LS-CHAR) - 65
                COMPUTE LS-HISTOGRAM(LS-CHAR-NUM) = LS-HISTOGRAM(LS-CHAR-NUM) + 1
                IF NOT IS-LESS-THAN-TWO(LS-CHAR-NUM)
                    MOVE 0 TO WS-RESULT
                END-IF
            END-IF.