
        IDENTIFICATION DIVISION.
        PROGRAM-ID. PANGRAM.
        ENVIRONMENT DIVISION.
    
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-SENTENCE PIC X(60).
        01 WS-RESULT PIC 9.
        LOCAL-STORAGE SECTION.
        01 LS-HISTOGRAM OCCURS 26 TIMES PIC 9(1) VALUE ZEROES.
        01 LS-IDX PIC 9(2) VALUE 0.
        01 LS-CHAR PIC X(1) VALUE " ".
        01 LS-CHAR-NUM PIC 9(3) VALUE 0. 
    
        PROCEDURE DIVISION.
        PANGRAM.
            PERFORM RESET-HISTOGRAM
            MOVE " " TO LS-CHAR
            INSPECT WS-SENTENCE REPLACING TRAILING SPACES BY "*"
            MOVE FUNCTION UPPER-CASE(WS-SENTENCE) TO WS-SENTENCE
            PERFORM COUNT-CHAR VARYING LS-IDX FROM 1 BY 1 UNTIL LS-IDX > 60 OR LS-CHAR = "*"
            PERFORM CHECK-HISTOGRAM-ALL-ONES.

        COUNT-CHAR.
            MOVE WS-SENTENCE(LS-IDX:1) TO LS-CHAR
            IF LS-CHAR IS ALPHABETIC AND LS-CHAR NOT = SPACE
                COMPUTE LS-CHAR-NUM = FUNCTION ORD(LS-CHAR) - 65
                MOVE 1 TO LS-HISTOGRAM(LS-CHAR-NUM)
            END-IF.

        CHECK-HISTOGRAM-ALL-ONES.
            MOVE 1 TO WS-RESULT 
            PERFORM VARYING LS-IDX FROM 1 BY 1 UNTIL LS-IDX > 26 OR WS-RESULT = 0
                MOVE LS-HISTOGRAM(LS-IDX) TO WS-RESULT
            END-PERFORM.
            
        RESET-HISTOGRAM.
            PERFORM VARYING LS-IDX FROM 1 BY 1 UNTIL LS-IDX > 26
                MOVE 0 TO LS-HISTOGRAM(LS-IDX)
            END-PERFORM.
            
