
       IDENTIFICATION DIVISION.
       PROGRAM-ID. LEAP.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       
       WORKING-STORAGE SECTION.
       01 WS-YEAR PIC 9(10) VALUE ZEROS.
       01 WS-RESULT PIC 9 VALUE ZEROS.
       LOCAL-STORAGE SECTION.
       01 LS-DIV PIC 9(10) VALUE ZEROS.
       01 LS-REM-400 PIC 9(10) VALUE ZEROS.
       01 LS-REM-100 PIC 9(10) VALUE ZEROS.
       01 LS-REM-4 PIC 9(10) VALUE ZEROS.

       PROCEDURE DIVISION.
       
       LEAP.
           DIVIDE WS-YEAR BY 400 GIVING LS-DIV REMAINDER LS-REM-400
           IF LS-REM-400 EQUAL TO 0 THEN
               MOVE 1 TO WS-RESULT
               EXIT PARAGRAPH
           END-IF
           
           DIVIDE WS-YEAR BY 100 GIVING LS-DIV REMAINDER LS-REM-100
           IF LS-REM-100 EQUAL TO 0 THEN
               MOVE 0 TO WS-RESULT
               EXIT PARAGRAPH
           END-IF
           
           DIVIDE WS-YEAR BY 4 GIVING LS-DIV REMAINDER LS-REM-4
           IF LS-REM-4 EQUAL TO 0 THEN
               MOVE 1 TO WS-RESULT
               EXIT PARAGRAPH
           END-IF.
